app/controllers/movies_controller.rb

  def index

    movies = Movie.find(:all) do
      if params[:_search] == "true"
        name =~ "%#{params[:name]}" if params[:name].present?
      end
    end

    @movies = Movie.all
---
SELECT * FROM "movies"

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "rating", "image_url", "director", "plot", "language", "seen", "tagline", "imdb_id", "year") VALUES('Kaminey', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2009)

  def update

    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
UPDATE "movies" SET "director" = '', "iurl" = '' WHERE "id" = 1

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "id" = 1133833840

  def find_movie
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1133833840)